johnkk1999/projects/stm32FastScope/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Adc_prescaler 1
#define Adc_stop 1050
#define Bnt_Led_Pin GPIO_PIN_13
#define Bnt_Led_GPIO_Port GPIOC
#define select_Pin GPIO_PIN_12
#define select_GPIO_Port GPIOB
#define select_EXTI_IRQn EXTI15_10_IRQn
#define inc_Pin GPIO_PIN_13
#define inc_GPIO_Port GPIOB
#define inc_EXTI_IRQn EXTI15_10_IRQn
#define dec_Pin GPIO_PIN_14
#define dec_GPIO_Port GPIOB
#define dec_EXTI_IRQn EXTI15_10_IRQn
#define ok_Pin GPIO_PIN_15
#define ok_GPIO_Port GPIOB
#define ok_EXTI_IRQn EXTI15_10_IRQn
#define mux_A_Pin GPIO_PIN_11
#define mux_A_GPIO_Port GPIOA
#define mux_B_Pin GPIO_PIN_12
#define mux_B_GPIO_Port GPIOA
#define mux_C_Pin GPIO_PIN_15
#define mux_C_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
